[Kippo Successful Login]
action.email = 1
action.email.inline = 1
action.email.sendresults = 1
action.email.to = root@localhost
alert.digest_mode = 0
alert.severity = 2
alert.suppress = 0
alert.track = 1
cron_schedule = * * * * *
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.events.fields = ["host","source","sourcetype","src_ip","username","password"]
display.visualizations.charting.chart = bar
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = eventtype=login_success

[Passwords by IP Address]
alert.track = 0
description = Used passwords by source ip address
dispatch.earliest_time = 0 
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | transaction src_ip | table src_ip, password

[Passwords by IP Address last 24h]
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | transaction src_ip | table src_ip,password

[Commands by IP Address]
alert.track = 0
dispatch.earliest_time = 0
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password"]
display.general.type = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | transaction src_ip,command | table src_ip,command

[Commands by IP Address last 24h]
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password"]
display.general.type = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | transaction src_ip,command | table src_ip,command

[Top 100 Passwords]
alert.track = 0
dispatch.earliest_time = 0
display.events.fields = ["host","source","sourcetype","src_ip","username","password"]
display.general.type = visualizations
display.visualizations.charting.chart = bar
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo| top limit=100 password

[Top 100 Passwords last 24h]
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password"]
display.general.type = visualizations
display.visualizations.charting.chart = bar
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo| top limit=100 password

[Top 20 Attackers]
alert.track = 0
dispatch.earliest_time = 0
display.events.fields = ["host","source","sourcetype","src_ip","username","password"]
display.general.type = visualizations
display.visualizations.charting.chart = bar
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo| top limit=20 src_ip

[Top 20 Attackers last 24h]
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password"]
display.general.type = visualizations
display.visualizations.charting.chart = bar
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo| top limit=20 src_ip

[Kippo Error]
action.email = 1
action.email.to = root@localhost
alert.severity = 4
alert.suppress = 1
alert.suppress.period = 12h
alert.track = 1
counttype = number of events
cron_schedule = 0 * * * *
description = Kippo Error, Restart Kippo!
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password"]
display.visualizations.charting.chart = bar
enableSched = 1
quantity = 3
relation = greater than
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo "exceptions.ValueError"

[Login Sessions last 24h]
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password","command"]
display.general.type = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | transaction src_ip startswith="login attempt \[*/*\] succeeded" endswith="connection lost" | table _time,src_ip,command

[Login Sessions last 30 Days]
alert.track = 0
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password","command"]
display.general.type = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | transaction src_ip startswith="login attempt \[*/*\] succeeded" endswith="connection lost" | table _time,src_ip,command

[Number of passwords per IP address last 24h]
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password","command"]
display.general.type = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | stats c(password) as nb_passwords by src_ip | sort - nb_passwords

[Number of passwords per IP address last week]
alert.track = 0
dispatch.earliest_time = -7d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password","command"]
display.general.type = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | stats c(password) as nb_passwords by src_ip | sort - nb_passwords

[Number of passwords per IP address last month]
alert.track = 0
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password","command"]
display.general.type = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | stats c(password) as nb_passwords by src_ip | sort - nb_passwords

[Attacker IP address country code last 24h]
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password","pw_len"]
display.general.type = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo eventtype="login_attempt" | geoip src_ip |top limit=100 src_ip_country_code

[Attacker IP address country code last week]
alert.track = 0
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password","pw_len"]
display.general.type = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo eventtype="login_attempt" | geoip src_ip |top limit=100 src_ip_country_code

[Weird passwords last 24h]
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password","pw_len"]
display.general.type = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | eval pw_len=len(password)| search pw_len>20 | top limit=100 password

[Weird passwords last week]
alert.track = 0
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password","pw_len"]
display.general.type = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | eval pw_len=len(password)| search pw_len>20 | top limit=100 password

[Password by IP address and country last 24h]
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | transaction src_ip | geoip src_ip | table src_ip_country_name,src_ip,password

[Password by IP address and country last week]
alert.track = 0
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","src_ip","username","password"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = splunk_for_kippo
request.ui_dispatch_view = search
search = index=kippo | transaction src_ip | geoip src_ip | table src_ip_country_name,src_ip,password

